# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/boneyard'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'

# Chat Apps
cask 'discord'
cask 'slack'

# Coding
cask 'visual-studio-code'
cask 'iterm2'
cask 'sequel-pro'
cask 'postman'

brew 'tmate'
cask 'ngrok'
brew 'bash'
brew 'zsh'
brew 'asdf'

# formulae
tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/rcm'

# Utils
brew 'bat'
brew 'gist'
brew 'git'
brew 'gnupg'
brew 'httrack'
brew 'less'
brew 'mas'
brew 'most'
brew 'rcm'
brew 'vim'
brew 'wget'
cask 'mactex'

# Misc
cask 'spotify'
cask 'bettertouchtool'
cask 'figma'
cask 'rectangle'
brew 'openvpn'
cask 'docker'
cask 'itsycal'
brew 'graphviz'
cask 'loopback'
cask 'nordvpn'

# Passwords
cask 'authy'
cask '1password'

# Mac Apps
mas 'Xcode', id:  497799835 #Xcode (12.3)
mas 'Houseparty', id:  1381523962 # Houseparty (1.14.8)
mas 'Excel', id:  462058435 # Microsoft Excel (16.44)
mas 'Bear', id:  1091189122 # Bear (1.8.2)
mas 'Todoist', id: 585829637 # Todoist (7.5)
mas 'DuckDuckGo PE', id: 1482920575 # DuckDuckGo Privacy Essentials (1.4.3)
mas 'Irvue', id: 1039633667 # Irvue (2.7.9)
